Repository: ChrisDCG/DictApp
Catalog: OpenAIDictate/Resources/Strings.*.resx
Languages: de

# TrayReadyText
source: Ready - press {0}
de: Bereit – {0} drücken

# TrayRecordingText
source: ● Recording ({0}:{1:D2}) - press {2} to stop
de: ● Aufnahme läuft ({0}:{1:D2}) – {2} zum Stoppen

# TrayTranscribingText
source: Transcribing…
de: Transkription läuft…

# TrayUnknownState
source: Unknown
de: Unbekannt

# ContextMenuSettings
source: Settings…
de: Einstellungen…

# ContextMenuExit
source: Quit
de: Beenden

# HotkeyRegistrationError
source: Failed to register the global hotkey ({0}).
de: Globaler Hotkey konnte nicht registriert werden ({0}).

# FatalErrorTitle
source: OpenAIDictate - Error
de: OpenAIDictate – Fehler

# FatalErrorMessage
source: A fatal error occurred: {0} The application will close.
de: Es ist ein schwerwiegender Fehler aufgetreten: {0} Die Anwendung wird beendet.

# OfflineStartWarning
source: No internet connection detected. Please connect and try again.
de: Keine Internetverbindung erkannt. Bitte verbinden Sie sich und versuchen Sie es erneut.

# MaxDurationReachedWarning
source: Maximum recording duration ({0} min) reached. Stopping recording.
de: Maximale Aufnahmedauer ({0} Min) erreicht. Aufnahme wird beendet.

# OfflineAfterRecordingWarning
source: No internet connection. Recording stopped, transcription will resume once you are online again.
de: Keine Internetverbindung. Aufnahme beendet – Transkription wird fortgesetzt, sobald Sie wieder online sind.

# TranscriptionComplete
source: Transcription completed ({0} characters).
de: Transkription abgeschlossen ({0} Zeichen).

# TranscriptionFailed
source: Transcription failed: {0}
de: Transkription fehlgeschlagen: {0}

# RecordingFailed
source: Recording could not be started: {0}
de: Aufnahme konnte nicht gestartet werden: {0}

# OfflineWarning
source: Offline mode active: no connection to the OpenAI API.
de: Offline-Modus aktiv: Keine Verbindung zur OpenAI API.

# OnlineInfo
source: Internet connection restored. Transcription is available again.
de: Internetverbindung wiederhergestellt. Transkription ist wieder möglich.

# SettingsAppliedInfo
source: Settings applied. Services have been reinitialized.
de: Einstellungen übernommen. Dienste wurden neu initialisiert.

# HotkeyUpdatedInfo
source: Hotkey updated to {0}.
de: Hotkey auf {0} aktualisiert.

# HotkeyUpdateFailed
source: Hotkey could not be updated: {0}
de: Hotkey konnte nicht aktualisiert werden: {0}

# SettingsOpenError
source: Settings dialog could not be opened: {0}
de: Einstellungsdialog konnte nicht geöffnet werden: {0}

# SettingsDialogTitle
source: OpenAIDictate - Settings
de: OpenAIDictate – Einstellungen

# SettingsTabGeneral
source: General
de: Allgemein

# SettingsTabAdvanced
source: Advanced
de: Erweitert

# SettingsTabAbout
source: About
de: Info

# SaveButton
source: Save
de: Speichern

# CancelButton
source: Cancel
de: Abbrechen

# ModelLabel
source: Model:
de: Modell:

# ModelOptionGpt4o
source: gpt-4o-transcribe (best quality, $0.006/min)
de: gpt-4o-transcribe (beste Qualität, 0,006 $/Min)

# ModelOptionGpt4oMini
source: gpt-4o-mini-transcribe (faster, $0.003/min)
de: gpt-4o-mini-transcribe (schneller, 0,003 $/Min)

# ModelOptionGpt4oDiarize
source: gpt-4o-transcribe-diarize (speaker labels, $0.008/min)
de: gpt-4o-transcribe-diarize (Sprechererkennung, 0,008 $/Min)

# TranscriptionLanguageLabel
source: Transcription language (ISO code):
de: Transkriptionssprache (ISO-Code):

# LanguagePlaceholder
source: e.g. de, en, fr
de: z. B. de, en, fr

# HotkeyLabel
source: Hotkey (start/stop):
de: Hotkey (Start/Stopp):

# HotkeyHelp
source: Format: F5, Ctrl+F9, Alt+Shift+F10 …
de: Format: F5, Strg+F9, Alt+Shift+F10 …

# MaxRecordingLabel
source: Max recording (minutes):
de: Max. Aufnahme (Minuten):

# GlossaryLabel
source: Custom glossary: (Domain-specific terms, names, products – comma separated)
de: Benutzerdefiniertes Glossar: (Fachbegriffe, Namen, Produkte – kommagetrennt)

# GlossaryPlaceholder
source: Example: Supreme Court, damages, § 280 BGB, Contoso GmbH
de: Beispiel: Bundesgerichtshof, Schadensersatz, § 280 BGB, Contoso GmbH

# PostProcessingLabel
source: LLM post-processing (punctuation via GPT-4o-mini)
de: LLM-basierte Nachbearbeitung (Interpunktion via GPT-4o-mini)

# ServerChunkingLabel
source: OpenAI server auto chunking (VAD + loudness normalization)
de: OpenAI-Server-Auto-Chunking (VAD + Lautstärke-Normalisierung)

# VadLabel
source: Voice Activity Detection (Silero VAD – removes silence and non-speech)
de: Voice Activity Detection (Silero VAD – entfernt Stille und Nicht-Sprachanteile)

# VadThresholdLabel
source: VAD speech probability threshold:
de: VAD-Sprachwahrscheinlichkeit (Schwellwert):

# VadMinSilenceLabel
source: Minimum silence between segments (ms):
de: Minimale Stille zwischen Segmenten (ms):

# VadMinSpeechLabel
source: Minimum speech duration (ms):
de: Minimale Sprachdauer (ms):

# VadPadLabel
source: Padding per speech segment (ms):
de: Padding je Sprachsegment (ms):

# LogProbabilitiesLabel
source: Return token log probabilities (gpt-4o models only)
de: Token-Logwahrscheinlichkeiten zurückgeben (nur gpt-4o-Modelle)

# DiarizedOutputLabel
source: Include diarized JSON output (speaker-attributed transcript)
de: Diarisiertes JSON mit Sprecherzuordnung ausgeben

# UiLanguageLabel
source: User interface language:
de: Sprache der Benutzeroberfläche:

# UiLanguageHelp
source: Applies immediately for tray text. Full UI refresh may require reopening dialogs.
de: Wirkt sofort in der Tray-Anzeige. Dialoge bitte neu öffnen, um alle Texte zu aktualisieren.

# BestPracticesText
source: These presets follow official OpenAI Cookbook guidance: • Natural-language glossaries improve recognition • GPT-generated prompts add domain context • Temperature = 0 guarantees deterministic output • Post-processing polishes punctuation and formatting
de: Diese Voreinstellungen orientieren sich am offiziellen OpenAI Cookbook: • Natürliche Glossare verbessern die Erkennung • GPT-generierte Prompts liefern Domänenkontext • Temperatur = 0 garantiert deterministische Ergebnisse • Nachbearbeitung optimiert Zeichensetzung und Format

# AboutText
source: OpenAIDictate v1.2.0 Professional voice dictation powered by OpenAI gpt-4o-transcribe. Highlights: • State-of-the-art accuracy (≥99%) • Global hotkey for any application • GPT-generated prompts for maximum quality • LLM-based post-processing • DPAPI encryption for API keys • No administrator rights required Built on: • OpenAI Cookbook best practices • Official API documentation • NAudio + Silero VAD License: MIT © 2025 OpenAIDictate Contributors
de: OpenAIDictate v1.2.0 Professionelle Diktatlösung mit OpenAI gpt-4o-transcribe. Highlights: • State-of-the-Art Genauigkeit (≥99 %) • Globaler Hotkey für jede Anwendung • GPT-generierte Prompts für maximale Qualität • LLM-basierte Nachbearbeitung • DPAPI-Verschlüsselung für API-Keys • Keine Administratorrechte erforderlich Basiert auf: • OpenAI Cookbook Best Practices • Offizieller API-Dokumentation • NAudio + Silero VAD Lizenz: MIT © 2025 OpenAIDictate Contributors

# SettingsSavedStatus
source: ✓ Settings saved successfully!
de: ✓ Einstellungen erfolgreich gespeichert!

# SettingsSaveError
source: ✗ Failed to save settings: {0}
de: ✗ Fehler beim Speichern: {0}

# GenericError
source: Error: {0}
de: Fehler: {0}

# HotkeyEmptyError
source: Hotkey must not be empty.
de: Hotkey darf nicht leer sein.

# HotkeyInvalidError
source: Invalid hotkey format. Examples: F5, Ctrl+Shift+F10.
de: Ungültiges Hotkey-Format. Beispiele: F5, Strg+Shift+F10.

# ApiKeyRequired
source: An OpenAI API key is required. The application will close.
de: OpenAI API-Schlüssel erforderlich. Die Anwendung wird beendet.

# ApiKeyPromptTitle
source: OpenAIDictate - API Key
de: OpenAIDictate – API-Schlüssel

# ApiKeyPromptMessage
source: Please enter your OpenAI API key: (available at platform.openai.com)
de: Bitte geben Sie Ihren OpenAI API-Schlüssel ein: (erhältlich unter platform.openai.com)

# DialogCancel
source: Cancel
de: Abbrechen

# SettingsRestartNotice
source: Some UI changes may require reopening dialogs to display the new language.
de: Einige UI-Änderungen werden erst nach erneutem Öffnen der Dialoge sichtbar.
